#####################################################################
# 실습문제22: n까지 합  02.반복문 13번 슬라이드
# lab 22
n = int(input('합산할 마지막 숫자: '))

j = 0
for i in range(1, n+1):
    j += i

print('합계: ', j)
##################################################################### 

##################################################################### 
# 참고: 사용자 입력에 대한 런타임 에러에 대비하는 코드
# while True:
#     try:
#         n = int(input('합산할 마지막 숫자: '))

#         j = 0
#         for i in range(1, n+1):
#             j += i

#         print('합계: ', j)
#     except Exception as e: # 예외 발생하면
#         print(e)
#     else: # 예외 발생하지 않으면
#         break
#     finally: # 어쨌거나 실행
#         print('종료')
##################################################################### 

