#####################################################################
# 실습문제30: 트리 별모양 출력   01.다양한형태의 제에문 14번 슬라이드
# lab 30

# double for version
n = 5
# i   : 0, 1, 2, 3, 4
# 공백: 4, 3, 2, 1, 0
# 별표: 1, 3, 5, 7, 9

for i in range(n):
    star = ''
    space = ''
    
    for j in range(n-i-1):
        space += '-'

    for k in range(i*2+1):
        star += '*'

    print(space+star)
##################################################################### 


# pythonic version
n = 5
for i in range(n):
    print(f"{'+'*(i*2+1):^{n*2-1}}")
##################################################################### 


n = 5
w = n*2-1 
for i in range(n):
    s =  '+' * (i*2+1)
    margin = w - len(s)
    margin = ' ' * int(margin / 2)
    print(margin, s, margin, sep='')
##################################################################### 

