#####################################################################
# 실습문제31: 프로야구팀 순위 출력
# lab 31
teams = ['랜더스', '자이언츠', '트윈스', '다이노스', '베어스', '타이거즈', '히어로즈', '라이온즈', '이글스', '위즈']

print('1위 :',  teams[0])
print('2위 :',  teams[1])
print('3위 :',  teams[2])
print('4위 :',  teams[3])
print('5위 :',  teams[4])
print('6위 :',  teams[5])
print('7위 :',  teams[6])
print('8위 :',  teams[7])
print('9위 :',  teams[8])
print('10위:',  teams[9])
##################################################################### 

