#####################################################################
#실습문제1: 화면에 프린트문으로 출력 03.출력문 19번 슬라이드
# lab 1
print("python is easy")
#####################################################################


#####################################################################
#실습문제2: 화면에 프린트문으로 출력 03.출력문 20번 슬라이드 
# lab 2
print("keyboard")
print('keyboard')
#####################################################################


#####################################################################
#실습문제3: 화면에 프린트문으로 출력 03.출력문 21번 슬라이드
# lab 3
print("Hello Python!")
print("Hello Startcoding!")
print("I can do it!")
#####################################################################


#####################################################################
#실습문제4: 화면에 프린트문으로 출력 03.출력문 22번 슬라이드
# lab 4
print("I love Python!")
# print("I hate Python!")
#####################################################################


#####################################################################
# 실습문제5: 변수에 문자열 저장 및 출력 01.문자열과 데이터 17번 슬라이드
# lab 5
country = "South Korea"
city = "Seoul"
gu = "Gang-nam"

print(country, city, gu)
#####################################################################


#####################################################################
# 실습문제6: 문자열 출력 01.문자열과 데이터 18번 슬라이드
# lab 6
print("Best Pop Songs")

singer1 = "Justin Bieber"
song1 = "Off My Face"
singer2 = "Charlie Puth"
song2 = "That's Hilarious"
print(singer1 + " - " + song1, 
      singer2 + " - " + song2, sep='\n')
#####################################################################


#####################################################################
# 실습문제7: 이름 입력받아 환영 메세지 출력하기 01.문자열과 데이터 19번 슬라이드
# lab 7
c = input()

print("안녕하세요. ", c, "님 환영합니다!!", sep="")
#####################################################################


#####################################################################
# 실습문제8: 이름,나이 입력받아 환영 메세지 출력하기 01.문자열과 데이터 20번 슬라이드
# lab 8
name = input("이름을 입력하세요: ")
age = input("나이를 입력하세요: ")

print("제이름은 ", name, "입니다.", sep="")
print("나이는 ", age, "살 입니다.", sep="")
#####################################################################


#####################################################################
# 실습문제9: 연산결과 예상하기 02.숫자데이터 데이터 11번 슬라이드
# lab 9
result = 100 + 20 / (4-2)*5
print(result)
#####################################################################


#####################################################################
# 실습문제10: 급여계산하기 02.숫자데이터 데이터 13번 슬라이드
# lab 10
# 시급, 일일근무시간, 한달동안 일한 날수, 보너스 입력받아서 이번달 급여

time_salary = int(input("시급: "))
workingtime_per_day = int(input("근무시간: "))
workday = int(input("근무날: "))
bonus = int(input("보너스: "))

print(time_salary * workingtime_per_day * workday + bonus)
#####################################################################


#####################################################################
# 실습문제11: 평균점 출력 02.숫자데이터 데이터 15번 슬라이드
# lab 11
# 영어, 수학, 국어, 과학
eng = int(input("영어 점수: "))
math = int(input("수학 점수: "))
kor = int(input("국어 점수: "))
sci = int(input("과학 점수: "))

print( (eng+math+kor+sci) / 4 )
#####################################################################


#####################################################################
# 실습문제12: 바둑돌 개수 02.숫자데이터 데이터 16번 슬라이드
# lab 12
# n 번째 줄의 바둑돌 개수 출력

n = int(input())

print( int(n*(n+1) / 2) )
#####################################################################


#####################################################################
# 실습문제13: BMI 02.숫자데이터 데이터 17번 슬라이드
# lab 13
# bmi = w / h^2
height = float(input("키(m): "))
weight = float(input("몸무게(Kg): "))

bmi = weight / height**2

print(bmi)
#####################################################################


#####################################################################
# 실습문제14: 두수 더하기 03.자료형변환 8번 슬라이드
# lab 14
a = int(input("첫번째 숫자를 입력하세요: "))
b = int(input("두번째 숫자를 입력하세요: "))

print(a+b)
#####################################################################


#####################################################################
# 실습문제15: 숫자 문자로 바꿔서 이어 붙이기  03.자료형변환 9번 슬라이드
# lab 15
number1 = 100
number2 = 200
number3 = 300

result = str(number1) +str(number2) + str(number3)
print(result)
#####################################################################


#####################################################################
# 실습문제16: 문자 반복하기 03.자료형변환 13번 슬라이드
# lab 16
fruit = input("과일 이름을 입력하세요: ")
times = int( input("출력할 횟수를 입력하세요: ") )

print(fruit*times)
#####################################################################


#####################################################################
# 실습문제17: 유튜브수익창출 가능 여부 출력 01.조건문 16번 슬라이드
# lab 17
subs = int( input("현재 구독자 수를 입력하세요: ") )

if subs >= 1000:
    print("수익 창출이 가능합니다!")
else:
    print("수익 창출이 불가능합니다!")
#####################################################################


#####################################################################
# 실습문제18: 공부시간  01.조건문 17번 슬라이드
# lab 18
st = int(input("공부시간을 입력하세요.(시간): "))

if st >= 10:
    print("휴대폰 감금이 해제됩니다.")
elif st >=5:
    print("휴대폰을 30분간 사용가능합니다.")
else:
    print("휴대폰 사용이 불가능합니다.")
#####################################################################


#####################################################################
# 실습문제19: 금액별로 저녁메뉴 정하기  01.조건문 18번 슬라이드
# lab 19
money = int(input("현재 가진 금액 입력: "))

if money >= 20000:
    print("오늘 저녁은... 치킨이다.")
elif money >= 10000:
    print("오늘 저녁은... 떡복이다")
elif money >= 2000:
    print("오늘 저녁은... 편의점 김밥")
#####################################################################


#####################################################################
# 실습문제20: for문 기본  02.반복문 7번 슬라이드
# lab 20
for i in range(5):
    print( (i+1)*100 )

for i in range(2,6):
    print(f"{i}번 앞으로 나와")
#####################################################################


#####################################################################
# 실습문제21: 3의배수  02.반복문 12번 슬라이드
# lab 21
# 100까지 3의 배수
i = 0
for j in range(33):
    i = i + 3
    print(i)
#####################################################################    


#####################################################################
# 실습문제22: n까지 합  02.반복문 13번 슬라이드
# lab 22
n = int(input('합산할 마지막 숫자: '))

j = 0

for i in range(1, n+1):
    j += i

print('합계: ', j)
##################################################################### 


#####################################################################
# 실습문제23: for->while  02.반복문 19번 슬라이드
# lab 23
for i in range(1, 11, 2):
    print(i)

i = 1

while i < 11:
    print(i)
    i = i + 2
##################################################################### 


#####################################################################
# 실습문제24: 구구단출력  02.반복문 20번 슬라이드
# lab 24
n = int(input("멏 단을 출력할까요?"))

for i in range(1,10):
    print(n, 'x', i, '=', n*i)
    # print(f"{n} x {i} = {n*i:>2d}")
#####################################################################     

    
#####################################################################
# 실습문제25: 유튜브수익  01.다양한형태의 제어문 05번 슬라이드
# lab 25
subs = int( input("현재 구독자 수: ") )
time = int( input("시청 시간: "))

if subs >= 1000 and time >= 4000:
    print("수익 창출 가능")
else:
    print("수익 창출 불가능")
#####################################################################     


#####################################################################    
# 실습문제26: 체력장 pass fail  01.다양한형태의 제어문 06번 슬라이드
# lab 26
a = int( input("팔굽혀펴기: ") )
b = int( input("윗몸일으키기: ") )
c = int( input("턱걸이: ") )

if a >= 30 or b >= 35 or c >= 5:
    print('pass')
else:
    print('fail')
#####################################################################     
    

#####################################################################
# 실습문제27: 면접시험점수 pass fail   01.다양한형태의 제어문 09번 슬라이드
# lab 27
test1 = int( input("필기시험 점수를 입력하세요: ") )

if test1 < 80:
    print("불합격")
else:
    test2 = input("면접결과를 입력하세요: ")
    if test2 == 'pass':
        print('최종합격')
    else:
        print("불합격")
#####################################################################     
        

#####################################################################        
# 실습문제28: 별모양 출력   01.다양한형태의 제어문 12번 슬라이드
# lab 28
for i in range(1, 6):
    print("*" * i)
##################################################################### 


#####################################################################
# 실습문제29: 별모양 출력   01.다양한형태의 제어문 13번 슬라이드
# lab 29
for i in range(5, 0, -1):
    print("*" * i)
##################################################################### 


#####################################################################
# 실습문제30: 트리 별모양 출력   01.다양한형태의 제어문 14번 슬라이드
# lab 30
n = 10
w = (n-1)*2 + 1 

for i in range(n):
    print( f"{'*' * (i*2+1):^{w}}" )
##################################################################### 
# lab 30
n = 10
w = (n-1)*2 + 1 

for i in range(n):
    s =  '*' * (i*2+1)
    margin = w - len(s)
    margin = ' ' * int(margin / 2)
    print(margin, s, margin, sep='')
##################################################################### 


#####################################################################
# 실습문제31: 메뉴 무한루프   01.다양한형태의 제어문 18번 슬라이드
# lab 31
while True:
    print("[메뉴를 입력하세요]")
    c = int( input("1.게임시작   2.랭킹보기   3.게임종료 >>>") )

    if c == 3:
        print("->게임을 종료합니다.")
        break
    elif c == 1:
        print("->게임을 시작합니다.")
    elif c == 2:
        print("->실시간 랭킹")
    else:
        print("다시 입력해주세요.")
##################################################################### 


#####################################################################        
# 실습문제32: updown숫자 맞추기   01.다양한형태의 제어문 19번 슬라이드
# lab 32
import random

nums = list(range(1, 101))
num = random.choice(nums)

print("컴퓨터가 숫자를 골랐습니다.")
n = -1
j = 0

while n != num:
    n = int( input("(1~100) 숫자를 맞춰 보세요 >>>") )
    j += 1

    if n > num:
        print('donw 입니다.')
    elif n < num:
        print('up 입니다.')
    else:
        print('정답입니다!')
        print('총시도 횟쉬: ', j)
        break
##################################################################### 


#####################################################################        
# 실습문제33: 리스트 홀수번째 합   02. 리스트 18번 슬라이드
# lab 33
nums = [5, 15, 2, -8, -12, -29, 43, 1]

# 홀수번째 원소의 합
# print( sum(nums[::2]) )

j = 0
for i in nums[::2]:
    j += i
    
print(j)
##################################################################### 


#####################################################################
# 실습문제34: 로또번호 추출기   02. 리스트 19번 슬라이드
# lab 34
import random 

nums = range(1,46)
lotto = []

while len(lotto) < 6:
    n = random.choice(nums)
    if n not in lotto: # if not(n in lotto):
        lotto.append(n)

print(lotto)
##################################################################### 


#####################################################################
# 실습문제35: 영한사전 -> 한영사전   
# lab 35
En2Ko = {
    'book': '책',
    'snake': '뱀',
    'language': '언어'
}

Ko2En = {}

for k, v in En2Ko.items():
    Ko2En[v] = k

print(Ko2En)
##################################################################### 


#####################################################################
# 실습문제36: 학생이름을 키로하고 총점과 평균이 저장된 리스트를 값으로 가지는 사전 만들기
# lab 36
data = [
    {'name':'철수', 'math':85, 'eng':90, 'sci':75},
    {'name':'준호', 'math':73, 'eng':85, 'sci':93},
    {'name':'영희', 'math':92, 'eng':88, 'sci':90}
]

ret = {}

for d in data:
    s = d['math'] + d['eng'] + d['sci']
    m = s / 3
    ret[d['name']] = [s, round(m, 3)]

print(ret)
#####################################################################


#####################################################################
# 실습문제37: 평균 구하기
# lab 37
L = [1,2,3,4,5,6,7,8,9,10]

def mean(L):
    return sum(L) / len(L)

print(mean(L))
##################################################################### 


#####################################################################
# 실습문제38: 표준편차 구하기
# lab 38
import math

L = [1,2,3,4,5,6,7,8,9,10]

def mean(L):
    return sum(L) / len(L)

def std(L):
    sigma = 0.0

    dev = [ (l - m)**2 for l in L ] # 편차
    sigma = math.sqrt(mean(dev)) # 편차의 평균의 제곱근
    
    return sigma
        

print(mean(L), std(L), math.stdev(L))
##################################################################### 


#####################################################################
# 실습문제39: n*n인 *로 그려진 정사각형
# lab 39

def draw_rect(n):
    for i in range(n):
        print('*'*n)

def draw_rect2(n):
    for i in range(n):
        if i == 0 or i == (n-1):
            print('*'*n)
        else:
            print('*'+ ' '*(n-2) + '*')

draw_rect2(1)
##################################################################### 


#####################################################################
# 실습문제40: n자씩 끊어 쓰기
# lab 40

def print_mxn(s, n):
    for i in range(0, len(s), n):
        sub_s =  s[i:i+n]
        
        print( sub_s + ('_' * (n - len(sub_s))) )


def print_by_n_characters(s, n):
    for i in range(0, len(s), n):
        print(s[i:i+n].ljust(n, '_'))


def wrap_and_fill(string, n):
    print(
        '\n'.join([string[i:i+n].ljust(n, '_') 
                   for i in range(0, len(string), n)])
    )
    

print_mxn("1234567", 3)
print_by_n_characters("1234567", 3)
wrap_and_fill("1234567", 3)
#####################################################################

#####################################################################
# 실습문제41: 369함수
# lab 41
def f369(n):
    if not isinstance(n, int) or n <= 0:
        print("자연수만 입력하세요.")
        return None
    
    str_n = str(n)

    print( '짝'*(str_n.count('3') + str_n.count('6') + str_n.count('9')) )

f369(-1)
f369('aaa')
f369(3.4)
f369(33569)
#####################################################################